<!DOCTYPE html>
<html lang="de">

<head>
  <meta charset="UTF-8" />
  <meta name="viewport" content="width=device-width, initial-scale=1.0" />
  <title>Datenschutzerkl&auml;rung &ndash; Three Flies Cocktail Collective</title>
  <meta name="description" content="Datenschutzhinweise f&uuml;r die Website von Three Flies Cocktail Collective." />
  <meta name="theme-color" content="#090a0f" />
  <link rel="preconnect" href="https://fonts.googleapis.com" />
  <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin />
  <link
    href="https://fonts.googleapis.com/css2?family=Playfair+Display:wght@500;700&family=Montserrat:wght@300;400;600&display=swap"
    rel="stylesheet" />
  <link rel="icon" type="image/png" href="assets/img/logo.png" />
  <link rel="stylesheet" href="assets/css/styles.css" />
</head>

<body class="legal-page">
  <header>
    <nav>
      <a href="index.html#hero" class="logo" aria-label="Three Flies Cocktail Collective &ndash; Startseite">
        <img class="logo-img" src="assets/img/logo.png" alt="Three Flies Cocktail Collective Logo" />
        <span>Three Flies Cocktails</span>
      </a>
      <a class="cta-button cta-shimmer" href="index.html#kontakt">Anfrage starten</a>
    </nav>
  </header>

  <main class="legal-main">
    <section class="legal-section">
      <div class="legal-heading">
        <span class="legal-kicker">Rechtliches</span>
        <h1>Datenschutzerkl&auml;rung</h1>
        <p class="legal-lead">Stand: <span id="privacy-date">12.10.2025</span></p>
      </div>

      <article class="legal-card">
        <h2>1. Verantwortlicher</h2>
        <p>
          Three Flies Cocktail Collective &ndash; vertreten durch Eric Schuck<br />
          <span>Hubert-Nees-Str. 7</span><br />
          <span>63785 Obernburg am Main</span><br />
          Deutschland
        </p>
        <p>
          E-Mail: <a href="mailto:threefliesbar@gmail.com">threefliesbar@gmail.com</a><br />
          Telefon: <a href="tel:+4915168106288">+49 1516 8106288</a>
        </p>
      </article>

      <article class="legal-card">
        <h2>2. Hosting &amp; Server-Logfiles</h2>
        <p>
          Diese Website wird &uuml;ber GitHub Pages betrieben (GitHub, Inc., 88 Colin P Kelly Jr St, San Francisco, CA 94107, USA).
          Beim Aufruf der Seiten verarbeitet GitHub Server-Logfiles (z. B. IP-Adresse, Datum und Uhrzeit des Zugriffs, angeforderte Datei,
          Referrer, User-Agent). Die Verarbeitung dient der technischen Bereitstellung, Stabilit&auml;t und Sicherheits&uuml;berwachung
          der Website.
        </p>
        <p>
          Die Domainverwaltung erfolgt &uuml;ber Namecheap, Inc. (4600 East Washington Street, Suite 305, Phoenix, AZ 85034, USA).
          Namecheap speichert in diesem Zusammenhang technische Metadaten (z. B. DNS-Anfragen), um die Erreichbarkeit der Domain sicherzustellen.
        </p>
        <p><strong>Rechtsgrundlage:</strong> Art. 6 Abs. 1 lit. f DSGVO (berechtigtes Interesse an einer sicheren und stabilen Bereitstellung).</p>
        <p><strong>Daten&uuml;bermittlung in Drittl&auml;nder:</strong> GitHub und Namecheap haben ihren Sitz in den USA. Die Daten&uuml;bermittlung erfolgt auf Grundlage
          von Standardvertragsklauseln der EU-Kommission und weiteren Sicherungsma&szlig;nahmen der Anbieter.</p>
        <p><strong>Speicherdauer:</strong> Logfiles werden automatisch gel&ouml;scht, sobald sie f&uuml;r die Erreichung der genannten Zwecke nicht mehr erforderlich sind.
          Genaue Angaben erteilen die genannten Anbieter.</p>
      </article>

      <article class="legal-card">
        <h2>3. Cocktail-Rechner &amp; lokale Verarbeitung</h2>
        <p>
          Der auf der Website eingebundene Cocktail-Rechner funktioniert ausschlie&szlig;lich clientseitig im Browser.
          Eingaben werden nicht an den Server &uuml;bertragen und nicht gespeichert. Die Berechnung erfolgt nur tempor&auml;r zur
          Anzeige der Mengenempfehlungen.
        </p>
      </article>

      <article class="legal-card">
        <h2>4. Kontaktaufnahme</h2>
        <p>
          Bei einer Kontaktaufnahme per E-Mail oder Telefon werden die &uuml;bermittelten Daten (Name, Kontaktdaten, Inhalt der Nachricht)
          verarbeitet, um die Anfrage zu beantworten und gegebenenfalls anzubieten.
        </p>
        <p><strong>Rechtsgrundlage:</strong> Art. 6 Abs. 1 lit. b DSGVO (vorvertragliche/vertragliche Kommunikation) sowie lit. f DSGVO (berechtigtes Interesse an der Bearbeitung von Anfragen).</p>
        <p><strong>Speicherdauer:</strong> Anfragen werden entsprechend gesetzlicher Aufbewahrungsfristen bzw. solange gespeichert, wie es f&uuml;r die Bearbeitung notwendig ist.</p>
      </article>

      <article class="legal-card">
        <h2>5. Eingebundene Inhalte Dritter</h2>
        <p>
          Zur Typografie nutzt diese Website Webfonts von Google. Beim Laden der Schriftarten wird eine Verbindung zu Servern von Google aufgebaut;
          dabei k&ouml;nnen IP-Adresse und technische Metadaten &uuml;bermittelt werden.
        </p>
        <ul>
          <li>Google Fonts &ndash; Google Ireland Limited, Gordon House, Barrow Street, Dublin 4, Irland (<a href="https://fonts.google.com/" target="_blank" rel="noopener">fonts.google.com</a>)</li>
        </ul>
        <p><strong>Rechtsgrundlage:</strong> Art. 6 Abs. 1 lit. f DSGVO (berechtigtes Interesse an einer konsistenten und performanten Darstellung).</p>
        <p>Weitere Informationen finden Sie in der Datenschutzerkl&auml;rung von Google: <a href="https://policies.google.com/privacy" target="_blank" rel="noopener">https://policies.google.com/privacy</a>.</p>
      </article>

      <article class="legal-card">
        <h2>6. Cookies &amp; Tracking</h2>
        <p>
          Es werden keine Cookies zu Analyse- oder Marketingzwecken gesetzt. Tracking- oder Remarketing-Dienste kommen nicht zum Einsatz.
        </p>
      </article>

      <article class="legal-card">
        <h2>7. Datensicherheit</h2>
        <p>
          Wir treffen technische und organisatorische Ma&szlig;nahmen, um Ihre Daten vor Verlust, Missbrauch oder unbefugtem Zugriff zu sch&uuml;tzen.
          Bitte nutzen Sie bei der &Uuml;bermittlung sensibler Informationen nach M&ouml;glichkeit verschl&uuml;sselte Kommunikationswege.
        </p>
      </article>

      <article class="legal-card">
        <h2>8. Ihre Rechte</h2>
        <p>Sie haben nach der DSGVO insbesondere folgende Rechte:</p>
        <ul>
          <li>Auskunft &uuml;ber die verarbeiteten personenbezogenen Daten (Art. 15 DSGVO)</li>
          <li>Berichtigung unrichtiger Daten (Art. 16 DSGVO)</li>
          <li>L&ouml;schung (Art. 17 DSGVO) und Einschr&auml;nkung der Verarbeitung (Art. 18 DSGVO)</li>
          <li>Daten&uuml;bertragbarkeit (Art. 20 DSGVO)</li>
          <li>Widerspruch gegen die Verarbeitung (Art. 21 DSGVO)</li>
          <li>Widerruf erteilter Einwilligungen mit Wirkung f&uuml;r die Zukunft (Art. 7 Abs. 3 DSGVO)</li>
          <li>Beschwerde bei einer Aufsichtsbeh&ouml;rde, z. B. <a href="https://www.bfdi.bund.de/DE/Service/Anschriften/anschriften_node.html" target="_blank" rel="noopener">Bundesbeauftragte f&uuml;r den Datenschutz</a></li>
        </ul>
      </article>

      <article class="legal-card">
        <h2>9. &Auml;nderungen dieser Datenschutzerkl&auml;rung</h2>
        <p>
          Wir behalten uns vor, diese Datenschutzerkl&auml;rung k&uuml;nftig anzupassen, damit sie den aktuellen rechtlichen Anforderungen entspricht oder
          um &Auml;nderungen unserer Leistungen widerzuspiegeln. F&uuml;r Ihren erneuten Besuch gilt die jeweils aktuelle Version.
        </p>
      </article>
    </section>
  </main>

  <footer class="site-footer">
    <div class="footer-inner">
      <div class="footer-brand">
        <img class="footer-logo" src="assets/img/logo.png" alt="Three Flies Cocktail Collective Logo" width="52" height="52" decoding="async" />
        <div class="footer-brand-copy">
          <span class="footer-brand-name">Three Flies Cocktail Collective</span>
          <span class="footer-tagline">Mobile Cocktailkultur f&uuml;r Events in und um Aschaffenburg.</span>
        </div>
      </div>
      <nav class="footer-links" aria-label="Fu&szlig;zeilen-Navigation">
        <a href="index.html#menu">Signature Drinks</a>
        <a href="index.html#kontakt">Kontakt</a>
        <a href="impressum.html">Impressum</a>
        <a href="datenschutz.html">Datenschutz</a>
      </nav>
      <div class="footer-meta">
        <span>&copy; 2025 Three Flies Cocktail Collective.</span>
        <span>Crafted in Germany mit Liebe &amp; Liquid Artistry.</span>
      </div>
    </div>
  </footer>

  <script>
    (function () {
      try {
        var el = document.getElementById('privacy-date');
        if (el) {
          el.textContent = new Date().toLocaleDateString('de-DE');
        }
      } catch (error) {
        // no-op
      }
    }());
  </script>
  <script src="assets/js/scripts.js" defer></script>
</body>

</html>
